#### Terraform Plan
```
module.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::727864369235:oidc-provider/token.actions.githubusercontent.com]
module.ssm.aws_ssm_parameter.openai_api_key: Refreshing state... [id=/trip-assistant/dev/openai-api-key]
module.api_lambda.aws_iam_role.lambda: Refreshing state... [id=trip-assistant-api-dev-role]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=trip-assistant-api]
module.agent_lambda.aws_iam_role.lambda: Refreshing state... [id=trip-assistant-agent-dev-role]
module.ecr.aws_ecr_repository.agent: Refreshing state... [id=trip-assistant-agent]
module.api_gateway.aws_apigatewayv2_api.api: Refreshing state... [id=takhous4qh]
module.api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.github_oidc.aws_iam_role.github_actions: Refreshing state... [id=trip-assistant-github-actions-dev]
module.ecr.aws_ecr_lifecycle_policy.api: Refreshing state... [id=trip-assistant-api]
module.ecr.aws_ecr_lifecycle_policy.agent: Refreshing state... [id=trip-assistant-agent]
module.agent_lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=trip-assistant-agent-dev-role-20260214103246950000000002]
module.agent_lambda.aws_iam_role_policy.ssm_read: Refreshing state... [id=trip-assistant-agent-dev-role:trip-assistant-agent-dev-ssm]
module.agent_lambda.aws_lambda_function.agent: Refreshing state... [id=trip-assistant-agent]
module.api_lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=trip-assistant-api-dev-role-20260214103246950000000001]
module.github_oidc.aws_iam_role_policy.ecr_push: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-ecr-push-dev]
module.github_oidc.aws_iam_role_policy.terraform: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-terraform-dev]
module.agent_lambda.aws_lambda_alias.env: Refreshing state... [id=arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-agent:dev]
module.agent_lambda.aws_cloudwatch_log_group.agent: Refreshing state... [id=/aws/lambda/trip-assistant-agent]
module.api_lambda.aws_iam_role_policy.invoke_agent: Refreshing state... [id=trip-assistant-api-dev-role:trip-assistant-api-dev-invoke-agent]
module.api_lambda.aws_lambda_function.api: Refreshing state... [id=trip-assistant-api]
module.api_lambda.aws_lambda_alias.env: Refreshing state... [id=arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-api:dev]
module.api_lambda.aws_cloudwatch_log_group.api: Refreshing state... [id=/aws/lambda/trip-assistant-api]
module.github_oidc.aws_iam_role_policy.lambda_deploy: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-lambda-deploy-dev]
module.api_gateway.aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api_gateway.aws_apigatewayv2_integration.lambda: Refreshing state... [id=axdty2l]
module.api_gateway.aws_apigatewayv2_route.default: Refreshing state... [id=9vf2v5v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github_oidc.aws_iam_role_policy.frontend_deploy will be created
  + resource "aws_iam_role_policy" "frontend_deploy" {
      + id          = (known after apply)
      + name        = "trip-assistant-frontend-deploy-dev"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "trip-assistant-github-actions-dev"
    }

  # module.github_oidc.aws_iam_role_policy.terraform will be updated in-place
  ~ resource "aws_iam_role_policy" "terraform" {
        id          = "trip-assistant-github-actions-dev:trip-assistant-terraform-dev"
        name        = "trip-assistant-terraform-dev"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (9 unchanged elements hidden)
                    {
                        Action   = [
                            "ecr:DescribeRepositories",
                            "ecr:ListTagsForResource",
                            "ecr:GetLifecyclePolicy",
                            "ecr:GetRepositoryPolicy",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ecr:us-east-2:*:repository/trip-assistant-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:CreateBucket",
                          + "s3:DeleteBucket",
                          + "s3:GetBucketPolicy",
                          + "s3:PutBucketPolicy",
                          + "s3:DeleteBucketPolicy",
                          + "s3:GetBucketAcl",
                          + "s3:GetBucketCORS",
                          + "s3:GetBucketWebsite",
                          + "s3:GetBucketVersioning",
                          + "s3:GetBucketLogging",
                          + "s3:GetBucketObjectLockConfiguration",
                          + "s3:GetBucketRequestPayment",
                          + "s3:GetBucketTagging",
                          + "s3:PutBucketTagging",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:PutEncryptionConfiguration",
                          + "s3:GetBucketPublicAccessBlock",
                          + "s3:PutBucketPublicAccessBlock",
                          + "s3:GetLifecycleConfiguration",
                          + "s3:GetReplicationConfiguration",
                          + "s3:GetAccelerateConfiguration",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::trip-assistant-frontend-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudfront:CreateDistribution",
                          + "cloudfront:DeleteDistribution",
                          + "cloudfront:GetDistribution",
                          + "cloudfront:UpdateDistribution",
                          + "cloudfront:TagResource",
                          + "cloudfront:UntagResource",
                          + "cloudfront:ListTagsForResource",
                          + "cloudfront:CreateOriginAccessControl",
                          + "cloudfront:DeleteOriginAccessControl",
                          + "cloudfront:GetOriginAccessControl",
                          + "cloudfront:UpdateOriginAccessControl",
                          + "cloudfront:ListOriginAccessControls",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.s3_cloudfront.aws_cloudfront_distribution.frontend will be created
  + resource "aws_cloudfront_distribution" "frontend" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all                        = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3-frontend"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3-frontend"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.s3_cloudfront.aws_cloudfront_origin_access_control.frontend will be created
  + resource "aws_cloudfront_origin_access_control" "frontend" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "trip-assistant-frontend-dev"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.s3_cloudfront.aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "trip-assistant-frontend-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_cloudfront.aws_s3_bucket_policy.frontend will be created
  + resource "aws_s3_bucket_policy" "frontend" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_cloudfront.aws_s3_bucket_public_access_block.frontend will be created
  + resource "aws_s3_bucket_public_access_block" "frontend" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_cloudfront.aws_s3_bucket_server_side_encryption_configuration.frontend will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "frontend" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.ssm.aws_ssm_parameter.openai_api_key will be updated in-place
  ~ resource "aws_ssm_parameter" "openai_api_key" {
        id              = "/trip-assistant/dev/openai-api-key"
      + insecure_value  = (known after apply)
        name            = "/trip-assistant/dev/openai-api-key"
        tags            = {
            "Environment" = "dev"
            "Project"     = "trip-assistant"
        }
      ~ value           = (sensitive value)
      ~ version         = 7 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + cloudfront_distribution_id = (known after apply)
  + frontend_s3_bucket         = (known after apply)
  + frontend_url               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @OsherKoren on `feature/infra`*